proffiling/stage2/flamegraphs/put_after/after_improve_put_wrk.txt
pc@pc-VirtualBox:~/2020-highload-dht$ wrk -t4 -c16 -d60s -s proffiling/STAGE_1/lua-scripts/put.lua -R15000 --latency http://127.0.0.1:8080
Running 1m test @ http://127.0.0.1:8080
  4 threads and 16 connections
  Thread calibration: mean lat.: 1.612ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.675ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.658ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.642ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.99ms    4.64ms 162.94ms   97.47%
    Req/Sec     3.99k   747.89    23.67k    88.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.51ms
 75.000%    2.18ms
 90.000%    2.91ms
 99.000%   11.14ms
 99.900%   87.29ms
 99.990%  155.39ms
 99.999%  162.43ms
100.000%  163.07ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.030     0.000000            1         1.00
       0.510     0.100000        74994         1.11
       0.815     0.200000       150068         1.25
       1.064     0.300000       225007         1.43
       1.293     0.400000       300222         1.67
       1.514     0.500000       374951         2.00
       1.630     0.550000       412461         2.22
       1.749     0.600000       449871         2.50
       1.876     0.650000       487507         2.86
       2.017     0.700000       524971         3.33
       2.179     0.750000       562414         4.00
       2.271     0.775000       581399         4.44
       2.369     0.800000       600051         5.00
       2.475     0.825000       618803         5.71
       2.595     0.850000       637475         6.67
       2.733     0.875000       656174         8.00
       2.813     0.887500       665377         8.89
       2.911     0.900000       674799        10.00
       3.031     0.912500       684142        11.43
       3.195     0.925000       693520        13.33
       3.431     0.937500       702870        16.00
       3.597     0.943750       707538        17.78
       3.829     0.950000       712218        20.00
       4.191     0.956250       716930        22.86
       4.743     0.962500       721613        26.67
       5.551     0.968750       726293        32.00
       6.079     0.971875       728618        35.56
       6.703     0.975000       730968        40.00
       7.419     0.978125       733313        45.71
       8.231     0.981250       735662        53.33
       9.119     0.984375       737994        64.00
       9.623     0.985938       739179        71.11
      10.135     0.987500       740330        80.00
      10.727     0.989062       741508        91.43
      11.447     0.990625       742687       106.67
      12.343     0.992188       743845       128.00
      12.903     0.992969       744441       142.22
      13.535     0.993750       745024       160.00
      14.239     0.994531       745602       182.86
      15.143     0.995313       746190       213.33
      16.463     0.996094       746779       256.00
      17.375     0.996484       747068       284.44
      18.591     0.996875       747359       320.00
      20.159     0.997266       747652       365.71
      22.415     0.997656       747945       426.67
      26.671     0.998047       748237       512.00
      32.479     0.998242       748384       568.89
      45.311     0.998437       748530       640.00
      59.999     0.998633       748677       731.43
      74.367     0.998828       748823       853.33
      89.151     0.999023       748969      1024.00
      96.575     0.999121       749043      1137.78
     103.807     0.999219       749116      1280.00
     110.975     0.999316       749189      1462.86
     118.143     0.999414       749262      1706.67
     125.823     0.999512       749335      2048.00
     129.407     0.999561       749372      2275.56
     133.119     0.999609       749410      2560.00
     136.831     0.999658       749445      2925.71
     140.415     0.999707       749482      3413.33
     144.255     0.999756       749518      4096.00
     146.303     0.999780       749537      4551.11
     148.095     0.999805       749558      5120.00
     149.759     0.999829       749573      5851.43
     151.807     0.999854       749592      6826.67
     153.727     0.999878       749610      8192.00
     154.623     0.999890       749620      9102.22
     155.519     0.999902       749628     10240.00
     156.415     0.999915       749638     11702.86
     157.311     0.999927       749647     13653.33
     158.207     0.999939       749656     16384.00
     158.591     0.999945       749660     18204.44
     159.359     0.999951       749665     20480.00
     159.743     0.999957       749669     23405.71
     160.255     0.999963       749674     27306.67
     160.767     0.999969       749679     32768.00
     161.023     0.999973       749683     36408.89
     161.023     0.999976       749683     40960.00
     161.151     0.999979       749685     46811.43
     161.663     0.999982       749688     54613.33
     161.919     0.999985       749690     65536.00
     162.047     0.999986       749693     72817.78
     162.047     0.999988       749693     81920.00
     162.047     0.999989       749693     93622.86
     162.559     0.999991       749695    109226.67
     162.687     0.999992       749697    131072.00
     162.687     0.999993       749697    145635.56
     162.687     0.999994       749697    163840.00
     162.687     0.999995       749697    187245.71
     162.815     0.999995       749699    218453.33
     162.815     0.999996       749699    262144.00
     162.815     0.999997       749699    291271.11
     162.815     0.999997       749699    327680.00
     162.815     0.999997       749699    374491.43
     162.943     0.999998       749700    436906.67
     162.943     0.999998       749700    524288.00
     162.943     0.999998       749700    582542.22
     162.943     0.999998       749700    655360.00
     162.943     0.999999       749700    748982.86
     163.071     0.999999       749701    873813.33
     163.071     1.000000       749701          inf
#[Mean    =        1.992, StdDeviation   =        4.642]
#[Max     =      162.944, Total count    =       749701]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  899867 requests in 1.00m, 57.50MB read
Requests/sec:  14997.82
Transfer/sec:      0.96MB
pc@pc-VirtualBox:~/2020-highload-dht$